# Exercicio 3

O objetivo desta tarefa é encontrar algum tipo de relação entre o atributo education e o atributo income da base de dados do censo

- Carregue o arquivo census.csv
- Crie um novo dataframe com o pandas utilizando somente esses dois campos
- Você pode utilizar o comando groupby do pandas para agrupar os dados, ou seja, a quantidade de registros baseado nesses dois atributos. Acesse aqui a documentação
- Identifique o nível de educação que possuem as maiores e menores rendas. Lembre-se que nesta base de dados a renda assume somente os valores >50 e <=50

In [31]:
import pandas as pd

dataset = pd.read_csv('Bases de dados/census.csv')

In [32]:
dataset.info()

<class 'pandas.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32561 non-null  int64
 1   workclass       32561 non-null  str
 2   final-weight    32561 non-null  int64
 3   education       32561 non-null  str
 4   education-num   32561 non-null  int64
 5   marital-status  32561 non-null  str
 6   occupation      32561 non-null  str
 7   relationship    32561 non-null  str
 8   race            32561 non-null  str
 9   sex             32561 non-null  str
 10  capital-gain    32561 non-null  int64
 11  capital-loos    32561 non-null  int64
 12  hour-per-week   32561 non-null  int64
 13  native-country  32561 non-null  str
 14  income          32561 non-null  str
dtypes: int64(6), str(9)
memory usage: 3.7 MB

In [33]:
df = dataset[['education', 'income']]
df.head()

    education  income
0   Bachelors   <=50K
1   Bachelors   <=50K
2     HS-grad   <=50K
3        11th   <=50K
4   Bachelors   <=50K

In [34]:
df['education'].value_counts()

education
HS-grad         10501
Some-college     7291
Bachelors        5355
Masters          1723
Assoc-voc        1382
11th             1175
Assoc-acdm       1067
10th              933
7th-8th           646
Prof-school       576
9th               514
12th              433
Doctorate         413
5th-6th           333
1st-4th           168
Preschool          51
Name: count, dtype: int64

In [35]:
df['income'].value_counts()

income
<=50K    24720
>50K      7841
Name: count, dtype: int64

In [36]:
df.groupby(['education', 'income'])['income'].count()

education     income
10th          <=50K      871
              >50K        62
11th          <=50K     1115
              >50K        60
12th          <=50K      400
              >50K        33
1st-4th       <=50K      162
              >50K         6
5th-6th       <=50K      317
              >50K        16
7th-8th       <=50K      606
              >50K        40
9th           <=50K      487
              >50K        27
Assoc-acdm    <=50K      802
              >50K       265
Assoc-voc     <=50K     1021
              >50K       361
Bachelors     <=50K     3134
              >50K      2221
Doctorate     <=50K      107
              >50K       306
HS-grad       <=50K     8826
              >50K      1675
Masters       <=50K      764
              >50K       959
Preschool     <=50K       51
Prof-school   <=50K      153
              >50K       423
Some-college  <=50K     5904
              >50K      1387
Name: income, dtype: int64

In [37]:
df = df.groupby(['education', 'income']).agg({'income': ['count']}).reset_index()
df.columns = ['education', 'income', 'count']

In [44]:
df = df.sort_values('count', ascending=False)

In [48]:
bachelors = df[df['education'] == ' Bachelors']
bachelors

     education  income  count
18   Bachelors   <=50K   3134
19   Bachelors    >50K   2221

In [59]:
# % <=50K
(bachelors[bachelors['income'] == ' <=50K']['count'] / bachelors['count'].sum()) * 100

18    58.524743
Name: count, dtype: float64

In [61]:
# % >50K
(bachelors[bachelors['income'] == ' >50K']['count'] / bachelors['count'].sum()) * 100

19    41.475257
Name: count, dtype: float64